tests/responses/invoice_9.json

{
  "id": 9,
  "proforma": false,
  "number": "2012-0004",
  "variable_symbol": "20120004",
  "your_name": "Alexandr Hejsek",
  "your_street": "Hopsinkov\u00e1 14",
  "your_street2": null,
  "your_city": "Praha",
  "your_zip": "10000",
  "your_country": "CZ",
  "your_registration_no": "87654321",
  "your_vat_no": "CZ87654321",
  "client_name": "Microsoft a. s.",
  "client_street": "Trojanova 1216/46",
  "client_street2": null,
  "client_city": "Praha",
  "client_zip": "11000",
  "client_country": "CZ",
  "client_registration_no": "28444501",
  "client_vat_no": "CZ28444501",
  "subject_id": 4,
  "generator_id": 4,
  "related_id": null,
  "token": "udDTG8Q88M",
  "status": "paid",
  "order_number": null,
  "issued_on": "2011-10-13",
  "taxable_fulfillment_due": "2011-10-13",
  "due": 10,
  "due_on": "2011-10-23",
  "sent_at": null,
  "paid_at": "2011-10-20T12:11:37+02:00",
  "reminder_sent_at": null,
  "accepted_at": null,
  "cancelled_at": null,
  "note": null,
  "footer_note": null,
  "bank_account": "1234/1234",
  "iban": null,
  "swift_bic": null,
  "payment_method": "bank",
  "currency": "CZK",
  "exchange_rate": "1.0",
  "language": "cz",
  "transferred_tax_liability": false,
  "subtotal": "40000.0",
  "total": "48000.0",
  "native_subtotal": "40000.0",
  "native_total": "48000.0",
  "lines": [
    {
      "name": "PC",
      "quantity": "1.0",
      "unit_name": "",
      "unit_price": "20000.0",
      "vat_rate": 20,
      "with_vat": false
    },
    {
      "name": "Notebook",
      "quantity": "1.0",
      "unit_name": "",
      "unit_price": "20000.0",
      "vat_rate": 20,
      "with_vat": false
    }
  ],
  "html_url": "https://subdomena.fakturoid.cz/invoices/9",
  "public_html_url": "https://subdomena.fakturoid.cz/p/udDTG8Q88M/2012-0004",
  "url": "https://subdomena.fakturoid.cz/api/v1/invoices/9.json",
  "subject_url": "https://subdomena.fakturoid.cz/api/v1/subjects/4.json",
  "updated_at": "2012-05-13T12:11:37+02:00"
}